// 注册协议
const REGISTRATION_AGREEMENT = [
  {
    title: '提示条款',
    children: [
      '您的信任对我们非常重要，先声诊断（或简称“我们”）制定本《注册协议》（或简称“本协议”）并提醒您：',
      '本协议适用于先声诊断的有爱医学患者端移动应用。',
      '请您注意，本协议不适用于以下情况：',
      '1、 通过我们的互联网电子服务或商品而接入的第三方服务（包括任何第三方网站）收集的信息；',
      '2、 通过在我们互联网电子服务或商品中进行广告服务的其他公司或机构所收集的信息。',
      '在使用先声诊断的各项互联网电子服务或商品前，请您务必仔细阅读并透彻理解本协议，在确认充分理解并同意后方可使用相关互联网电子服务或商品。一旦您开始使用互联网电子服务或商品，将被视为对本协议内容的接受和认可。'
    ]
  },
  {
    title: '定义',
    children: [
      '《有爱医学用户注册协议》：您与有爱医学订立的关于您使用有爱医学平台的协议。',
      '“有爱医学”：指江苏先声医学诊断有限公司',
      '在本声明和政策中更多地称为“有爱”或“有爱平台”。'
    ]
  },
  {
    title: '一、 总则',
    children: [
      '1、 有爱医学平台是一个医疗健康交流互通平台，为确保您能正常地使用此平台，您应当阅读并遵守本协议。请您务必审慎阅读、充分理解各条款内容，以及开通或使用某项服务的单独协议，并选择接受或不接受。',
      '2、 除非您已阅读并接受本协议所有条款，否则您无权使用有爱医学平台服务。',
      '3、 有爱平台为充分保护您对于平台提供的各项服务的知情权，平台就其提供的各项服务的相关性、有效性以及限制性提供以下注册条款。在此特别提醒您，在您使用注册前已确实仔细阅读了本协议，如果您对本协议的任何条款或者将来随时可能修改、补充的条款有异议，您可选择不注册。',
      '4、 您在进行登录注册程序过程中，当您点选“同意”按钮时即视为您已仔细阅读本协议，同意接受本协议项下的所有条款，包括接受有爱平台对本协议条款随时所做的任何修改，并愿意受其约束。之后方能正常使用平台提供的互联网电子服务或商品。',
      '5、 您在有爱有爱平台提问、搜索、提供各项电子信息、与其它用户交流及其他电子服务，即代表您已经同意本协议。',
      '6、 本协议的条款适用于有爱提供的各种服务，但当您使用有爱某一特定服务时，如该服务另有单独的服务条款、指引或规则，您应遵守本协议及平台随时公布的与该服务相关的服务条款、指引或规则等。前述所有的指引和规则，均构成本协议的一部分。除非本协议另有其他明示规定，新推出的产品或服务、增加或强化目前本服务的任何新功能，均受到本协议之规范。'
    ]
  },
  {
    title: '二、 本协议的确认和接纳',
    children: [
      '1、 有爱平台的互联网电子服务或商品的所有权和运作权归平台所有。您同意所有登录注册协议条款并完成登录注册程序，才能成为有爱平台的正式用户。您确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。',
      '2、 您点击登录，即视为您确认自己具有享受有爱平台服务、下单购买等相应的权利能力和行为能力，能够独立承担法律责任。',
      '3、 如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用有爱平台。',
      '4、 有爱平台保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。',
      '5、 有爱平台运用自己的操作系统为您提供互联网电子服务或商品，并承担本协议和其它服务协议中对您的责任和义务。为使用本服务，您必须能够自行通过有法律资格的第三方对您提供互联网接入服务，并自行承担以下内容：',
      '(1)自行配备上网所需的设备，包括个人电脑，调制解调器及其他必要的设备装置。',
      '(2)自行承担上网所需的相关必要费用，如：电话费用、网络费用等。',
      '(3)本协议中规定的您的其他责任和义务。', '6、 您应保证：提供详尽、真实、准确和完整的个人资料以符合实名认证的要求。如果资料发生变动，您应及时更改。若您提供任何错误、不实、过时或不完整的资料，并为有爱平台所确知，或者有爱平台有合理由怀疑前述资料为错误、不实、过时或不完整的资料，本平台有权暂停或终止对您的账号提供服务，并拒绝现在或将来申请使用本服务的全部或一部分的请求。', '7、 本服务不会提供给被暂时中止或永久终止资格的有爱平台用户。'
    ]
  },
  {
    title: '三、 用户依法言行义务',
    children: [
      '本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：',
      '1、 不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；',
      '2、 从中国大陆向境外传输资料信息时必须符合中国有关法规；',
      '3、 不得利用有爱平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；',
      '4、 不得干扰有爱平台的正常运转，不得侵入有爱平台及国家计算机信息系统；',
      '5、 不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；',
      '6、 不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；',
      '7、 不得教唆他人从事本条所禁止的行为。'
    ]
  },
  {
    title: '四、 用户管理',
    children: [
      '1、 在进行注册过程中，您的用户名注册与使用应符合网络道德，遵守中华人民共和国的相关法律法规。您的用户名和昵称中不能含有威胁、淫秽、谩骂、非法、侵害他人正当权益等有争议性的文字。您在有爱上的言论不得违法、不得违反公序良俗、不得使用攻击性语言恶意中伤他人，或作出虚假性陈述。您保证您在有爱上提供的信息的真实性、合法性和有效性。您单独承担在有爱上发布内容的一切相关责任。您使用或提供的服务应遵守所有适用于有爱的地方法律、国家法律和国际法律标准。',
      '2、 您应遵守从中国境内向外传输技术性资料时必须符合中国有关法律法规。',
      '3、 您不得使用本服务于其他非法用途。',
      '4、 您不得干扰或扰乱本服务，不得盗用他人账号，如有上述行为，您需对此行为造成的后果负责。',
      '5、 您应遵守所有使用本服务的各项协议、规定、程序和惯例。您须承诺不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽等信息资料。另外，您也不能传输任何教唆他人构成犯罪行为的资料；不能传输助长国内不利条件和涉及国家安全的资料；不能传输任何不符合当地法规、国家法律和国际法律的资料。未经许可而非法进入其它电脑系统是禁止的。',
      '6、 您不得发布任何不基于事实、虚构、夸大、引人误解的信息；不得发布涉及政治、性别、种族歧视或攻击他人的文字、图片、视频或语言等信息；不得发布介绍个人、科室等广告性质的内容；不得有其它涉及违反当地法规、国家法律和国际法律的行为。',
      '7、 您发布的文章、视频、资讯不得侵犯任何第三方的合法知识产权。',
      '8、 若您的行为不符合本协议的规定，有爱有权做出独立判断，并立即停止向该您账号提供服务。您需对自己在网上的行为承担法律责任。您若在有爱上散布和传播反动、色情或其他违反国家法律的信息，有爱的系统记录有可能作为您违反法律的证据。',
      '9、 您的授权行为：对有爱而言，您账号和密码是唯一验证您真实性的依据，只要使用了正确的您账号和密码无论是谁登录均视为已经得到您本人的授权。',
      '10、 您同意您勾选知情同意选项或采纳医生建议即视为风险提示已告知并获得您的知情同意。',
      '11、 在接受互联网诊疗服务时，用户应提供相关就诊者初诊数据，并保证所提供的初诊数据的完整性、真实性、合法性和准确性。',
      '12、 您的授权行为：用户同意授权有爱获取患者数据，并为患者服务的目的使用所有就诊数据，包括用户在其他实体医疗机构的数据。',
      '13、 根据相关法律法规规定，用户应理解互联网诊疗不涉及面诊、触诊、初诊，医生仅根据患者提供的信息和初诊数据提供复诊服务。'
    ]
  },
  {
    title: '五、 用户责任',
    children: [
      '1、 您同意保障和维护有爱平台的利益，如果因为您违反有关法律、法规或本协议的任何规定而给有爱、有爱平台医生或任何其他第三方造成任何损失，您统一承担由此产生的损害赔偿责任，其中包括但不限于有爱为此而支付的律师费用。',
      '2、 您同意承担包括但不限于如下违反相关法律法规或违反平台规则情形造成的全部责任：',
      '（1）提供信息不完整、不真实、不准确，对医生诊断产生误导影响；',
      '（2）未按要求完善电子病历等；',
      '（3）您或者您的近亲属不配合医疗机构进行符合诊疗规范的诊疗；',
      '（4）以任何形式侵犯他人名誉权等行为。'
    ]
  },
  {
    title: '六、 您的账号、密码和安全性',
    children: [
      '1、 您一旦登录注册成功，成为有爱平台的合法用户，手机号码将成为您登录账号，登录验证码为登录密码。您要对任何以您账号进行的活动和事件负全责。请毋将手机号和验证码随意泄漏。',
      '2、 因黑客行为或您的保管疏忽等情况导致登录账号、验证码密码遭他人非法使用，有爱平台不承担责任。有爱将根据法律法规的要求，履行其作为移动互联网信息服务提供者应当履行的义务。'
    ]
  },
  {
    title: '七、 收费服务',
    children: [
      '1、 有爱平台的相关服务是以收费方式提供的，如您使用收费服务，请遵守相关的协议。',
      '2、 请您在支付费用时，仔细阅读收费服务的相关协议，除协议约定的情况外，否则，有爱将不予退费。退费的方式视支付方式的不同而不同。用户应严格依据退费方式及退费周期收回退款。',
      '3、 有爱可能根据实际需要对收费服务的收费标准、方式进行修改和变更，有爱也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，有爱将在相应服务页面进行通知或公告。如果您不同意上述修改、变更或付费内容，则应停止使用该服务。'
    ]
  },
  {
    title: '八、 服务暂停、变更与中止条款',
    children: [
      '1、 鉴于移动互联网服务的特殊性，有爱有权随时变更、中止或终止部分或全部的服务。如变更、中止或终止的服务属于免费服务，有爱无需通知您，也无需对您或任何第三方承担任何责任。',
      '2、 您理解，有爱需要定期或不定期地对提供本服务的平台或相关的设备进行检修或者维护，如因此类情况而造成本服务在合理时间内的中断，有爱无需为此承担任何责任，但有爱应尽可能事先进行通告。',
      '3、 如发生下列任何一种情形，有爱有权随时中断或终止向您提供本协议项下的服务而无需对您或任何第三方承担任何责任：',
      '(1) 您违反国家有关法律法规或有爱平台规定，侵害他人合法权益的；',
      '(2) 您提供的个人资料不真实；',
      '(3) 您违反本协议中的规定；',
      '(4) 您违反有爱发布的政策；',
      '(5) 有爱认为其他不适宜的地方。'
    ]
  },
  {
    title: '九、 结束服务',
    children: [
      '您或有爱可随时根据用户管理的规范（参见本协议的第四条）和实际情况中断一项或多项本服务，有爱无需对您或任何其他第三方负责。您对本协议的修改有异议，或对有爱的服务不满，可以行使如下权利：',
      '1、 停止使用有爱提供的服务。',
      '2、 通告有爱停止对该您账号的服务。结束您的服务后，您使用本服务的权利马上终止，即刻，有爱不对您承担任何义务和责任。'
    ]
  },
  {
    title: '十、 隐私及个人信息的保护',
    children: [
      '1、 保护您隐私是有爱的一项基本政策。',
      '2、 您的信任对有爱非常重要，有爱深知个人信息安全的重要性，有爱将按照法律法规要求，采取安全保护措施，保护您的个人信息安全。具体详见《法律声明及隐私权政策》。'
    ]
  },
  {
    title: '十一、 对第三方责任的声明',
    children: [
      '有爱因服务必要，可能会将相关网站链接至有爱开展合作的伙伴的网站（统称“第三方网站”）。如果您使用有爱提供的链接访问第三方网站，这些网站的运营商可能会收集您的个人信息。有爱尽力确保所有链接的第三方网站采用同等的个人信息保护措施，但是有爱不对这些第三方网站上的活动、隐私权政策或隐私保护水平承担任何法律或其他责任。'
    ]
  },
  {
    title: '十二、 知识产权条款',
    children: [
      '1、 您一旦接受本协议，即表明您主动将其在任何时间段在有爱平台发表的任何形式的信息内容（包括但不限于用户评价、用户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给有爱所有，您同意有爱有权就任何主体侵权而单独提起诉讼。',
      '2、 本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于您在有爱平台上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。',
      '3、 您同意并已充分了解本协议的条款，承诺不将已发表于有爱平台的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类网站、媒体上使用）。',
      '4、 有爱平台，拥有有爱平台内容及资源的著作权等合法权利，受国家法律保护，有权不时地对本协议及有爱平台的内容进行修改，并在有爱平台张贴，无须另行通知您。在法律允许的最大限度范围内，有爱对本协议及有爱平台的内容拥有解释权。',
      '5、 除法律另有强制性规定外，未经有爱明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用有爱平台的信息内容，否则，有爱有权追究其法律责任。',
      '6、 有爱平台所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是有爱或其内容提供者的财产，受中国和国际版权法的保护。有爱平台上所有内容的汇编是有爱的排他财产，受中国和国际版权法的保护。有爱平台上的所有软件都是有爱或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。'
    ]
  },
  {
    title: '十三、 特别授权',
    children: [
      '您完全理解并不可撤销地授予有爱下列权利：',
      '1、 一旦您向有爱作出任何形式的承诺，且相关机构已确认您违反了该承诺，则有爱有权立即按您的承诺或协议约定的方式对您的账户采取限制措施，包括中止或终止向您提供服务，并公示相关机构确认的您的违约情况。您了解并同意，有爱无须就相关违约事项与您核对事实，或另行征得您的同意，且有爱无须就此限制措施或公示行为向您或任何第三方承担任何的责任。',
      '2、 一旦您违反本协议、或与有爱签订其他协议的约定，有爱有权以任何方式通知本服务或其他相关有爱服务，要求其对您的权益采取限制措施，包括但不限于要求中止、终止对您提供的部分或全部服务，且在其经营或实际控制的网站或APP公示您的违约情况。',
      '3、 您授权有爱使用您注册登录、使用本服务过程中形成的信息，并允许其通过短信、邮件、电话或其他形式向您传送有爱提供的服务。您同意接受有爱通过短信、邮件、电话或其他形式向您发送活动、服务或其他相关商业信息。如果您不需要有爱提供的部分或全部服务的活动、服务或其他相关商业信息的服务，在您向有爱客服提出申请后予以中止、终止对您提供的该部分或全部服务。'
    ]
  },
  {
    title: '十四、 有爱拒绝提供担保',
    children: [
      '1、 您对移动网络服务的使用承担风险，并承担因为使用移动网络服务而产生的一切后果。有爱对此不作任何类型的担保，不论是明确的或隐含的，但是不对商业性的隐含担保、特定目的和不违反规定的适当担保作限制。',
      '2、 有爱不担保本服务一定能完全满足您的要求，也不担保本服务不会受网络、通信等原因而中断，对服务的及时性、安全性、错误程序的发生都不作担保。',
      '3、 有爱因受合作医疗机构等资源限制，就您所提的请求不担保服务一定能够成功。',
      '4、 有爱对在有爱平台上得到的任何有关健康的咨询意见等，不作担保。',
      '5、 您不能从有爱得到口头或书面的意见或信息（增加除外条款，而并非全部），有爱也不会在此做明确担保。',
      '6、 除非另有明确的书面说明，有爱平台及其所包含的或以其它方式通过有爱平台提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。除非另有明确的书面说明，有爱不对有爱平台的运营及其包含在有爱平台上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。',
      '7、 有爱不担保有爱平台包含的或以其它方式通过有爱平台提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从有爱平台发出的电子信件、信息没有病毒或其他有害成分。如因不可抗力或其它有爱平台无法控制的原因使有爱平台系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，有爱会合理地尽力协助处理善后事宜。',
      '8、 有爱平台所承载的内容（文、图、视频、音频）均为传播有益健康资讯目的，不对其真实性、科学性、严肃性做任何形式保证。'
    ]
  },
  {
    title: '十五、 责任限制',
    children: [
      '1、 有爱平台服务是按照现有技术和条件所能达到的水平提供的服务。有爱会尽最大努力为您提供服务，确保服务的连贯性和安全性；但有爱不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。有爱所不能控制的事件而影响有爱提供服务，有爱无须承担任何责任。',
      '2、 有爱对您使用网络服务而受到的任何直接、间接、偶然、特殊及继起的损害（有爱违反法律、法规和本协议的条款除外）不负责任，这些损害可能来自：不正当使用网络服务，私自在网上进行交易，非法使用网络服务或您传送的信息有所变动。这些行为都有可能会导致有爱的形象受损，所以有爱事先提出这种损害的可能性。',
      '3、 有爱所有信息仅供参考。有爱致力于提供正确、完整的健康资讯，但不保证信息的绝对正确性和完整性，且不对因信息的不正确或遗漏导致的任何损失或损害承担责任。有爱所提供的任何健康资讯，仅供参考，不能替代医生和其他医务人员的建议，如自行使用有爱资料发生偏差，有爱不承担任何法律责任。',
      '4、 因医生的诊疗行为产生的医疗责任由医生承担，国家法律法规政策对此有规定的，以规定为准。',
      '5、 有爱拒绝回复的问题，包括但不限于如下情况：',
      '（1）非各项电子类问题，如动物疾病问题、社会意识形态问题等；',
      '（2）医疗司法举证或询证问题；',
      '（3）胎儿性别鉴定问题；',
      '（4）未按提问要求提问，如提问时未指定医生，却要求具体医生回复；',
      '（5）有危害他人/自己可能的问题；',
      '（6）追问医生个人信息的问题；',
      '（7）故意挑逗、侮辱医生的提问。',
      '6、 有爱平台所提供的任何各项电子信息，症状自查等服务仅供参考，如自行使用有爱平台中资料发生偏差，有爱概不负责，亦不负任何法律责任。',
      '7、 有爱保留对本声明作出不定时修改的权利。',
      '8、 有爱不对您所发布信息的删除或储存失败负责。有爱积极采用数据备份加密等措施保障您数据的安全，但不对由于因意外因素导致的数据损失和泄漏负责。有爱有权审查和监督您的行为是否符合本协议的要求，如果您违背了本协议的约定，则有爱有权中断您的服务。',
      '9、 您同意因下列情形之一的，有爱不承担赔偿责任：',
      '（1）患者或者其近亲属不配合进行符合诊疗规范的诊疗；',
      '（2） 医务人员在紧急情况下已经尽到合理诊疗义务；',
      '（3）限于当时的医疗水平难以诊疗。',
      '10、 如果您或第三方就相关服务购买了保险，因发生保险事故导致损失的，保险公司已经向您或第三方承担或许诺承担保险理赔责任后，有爱在此范围内不再承担赔偿责任。'
    ]
  },
  {
    title: '十六、 广告说明',
    children: [
      '1、 有爱平台上为您的便利而提供的外部链接，包括但不限于任何广告内容链接，以及该链接所指向网页之所有内容，均系该网页所属第三方的所有者制作和提供（以下简称“第三方网页”）。第三方网页并非也不反映有爱之任何意见和主张，也不表示有爱同意或支持该第三方网页上的任何内容、主张或立场。有爱对第三方网页中内容之合法性、准确性、真实性、适用性、安全性和完整性等概不承担任何责任。任何单位或个人如需要第三方网页中内容（包括资讯、资料、消息、产品或服务介绍、报价等），并欲据此进行交易或其他行为前，应慎重辨别这些内容的合法性、准确性、真实性、适用性、完整性和安全性（包括下载第三方网页中内容是否会感染电脑病毒），并采取谨慎的预防措施。如您不确定这些内容是否合法、准确、真实、实用、完整和安全，建议您先咨询专业人士。',
      '2、 任何单位或者个人因相信、使用第三方网页中信息、服务、产品等内容，或据此进行交易等行为，而引致的人身伤亡、财产毁损（包括因下载而感染电脑病毒）、名誉或商誉诽谤、版权或知识产权等权利的侵犯等事件，及因该等事件所造成的损害后果，有爱概不承担任何法律责任。无论何种原因，有爱不对任何非与有爱直接发生的交易和行为承担任何直接、间接、附带或衍生的损失和责任。'
    ]
  },
  {
    title: '十七、 协议修改',
    children: [
      '根据国家法律法规变化及网络运营需要，有爱有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在有爱平台上即生效，并代替原来的协议，有爱将公告通知变更信息。您可随时登陆查阅最新协议；您有义务不时关注并阅读最新版的协议及有爱平台公告。如您不同意更新后的协议，可以且应立即停止接受有爱平台依据本协议提供的服务；如您继续使用有爱平台提供的服务，即视为同意更新后的协议。有爱建议您在使用有爱平台之前阅读本协议及有爱平台的公告。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。当发生有关争议时，以最新的服务协议为准。'
    ]
  },
  {
    title: '十八、 通告',
    children: [
      '1、 本协议项下所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行；该等通知于发送之日视为已送达。',
      '2、 您对于有爱的通知应当通过有爱平台对外正式公布的通信地址、电子邮件地址等联系信息进行邮寄书面送达。'
    ]
  },
  {
    title: '十九、 法律管辖和适用',
    children: [
      '1、 本协议签订于中华人民共和国江苏省南京市玄武区。',
      '2、 本协议之效力、解释、执行和争议的解决均适用中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。',
      '3、 如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方可提交本协议签订地有管辖权的人民法院诉讼裁决。'
    ]
  },
  {
    title: '二十、 其他',
    children: [
      '1、 有爱尊重您的合法权利，本协议及有爱平台上发布的各类规则、声明等其他内容，均是为了更好地、更加便利地为您提供服务。有爱平台欢迎您和社会各界提出意见和建议，有爱将虚心接受并适时修改本协议及有爱平台的各类规则。',
      '2、 本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请您着重阅读。',
      '3、 您注册登录使用有爱平台即视为您完全接受本协议，在点击“登录”之前请您再次确认已知悉并完全理解本协议的全部内容。'
    ]
  }
]

const PRIVACY_POLICY = [
  {
    title: '提示条款',
    children: [
      '您的信任对我们非常重要，我们深知个人信息安全的重要性，我们将会按照法律法规要求，采取安全保护措施保护您的个人信息安全 。鉴此，有爱（或简称“我们”）制定本《法律声明及隐私权政策》（以下或简称“本声明和政策”）并提醒您：',
      '本声明和政策适用于有爱的互联网电子服务或商品。如关联公司（范围详见定义部分）的互联网电子服务或商品中使用了有爱提供的互联网电子服务或商品（例如直接使用有爱账户登录）但未设独立法律声明及隐私权政策的，则本声明和政策同样适用于该部分互联网电子服务或商品。',
      '请您注意，本声明和政策不适用于以下情况：',
      '1、通过我们的互联网电子服务或商品接入的第三方服务 （包括任何第三方网站）收集的信息；',
      '2、通过在我们互联网电子服务或商品中进行广告服务的其他公司或机构所收集的信息。',
      '希望您在使用有爱的各项互联网电子服务或商品前，仔细阅读并透彻理解本声明和政策，您开始使用我们的各项服务，即意味着您对本声明和政策内容的接受与认可。'
    ]
  },
  {
    title: '定义',
    children: [
      '·有爱医学',
      '指南京玄武有爱诊所有限公司',
      '在本声明和政策中更多地称为“有爱”或“有爱平台”。',
      '·有爱服务提供者',
      '指南京玄武有爱诊所有限公司',
      '·关联公司',
      '有爱直接或间接控股的公司，参股或形成经营、协作的，具有关联关系的企业。',
      '·用户',
      '指有爱平台服务的使用人，在本声明和政策中更多地称为“您”或“用户”。'
    ]
  },
  {
    title: '法律声明',
    children: []
  },
  {
    title: '一、权利归属',
    children: [
      '1.1. 有爱的“Logo”、“有爱”等文字、图形及其组合，以及有爱的其他标识、徽记、有爱服务的名称等为有爱及其关联公司在中国和其他国家的注册商标。未经有爱书面授权，任何人不得以任何方式展示、使用或做其他处理（包括但不限于复制、传播、展示、镜像、上传、下载），也不得向他人表明您有权展示、使用或做其他处理。',
      '1.2. 有爱所有的产品、服务、技术与所有程序（以下或简称“技术服务”）的知识产权均归属于有爱或归其权利人所有。',
      '1.3. 除非有爱另行声明，有爱拥有在有爱网站内发布文档等信息（包括但不限于文字、图形、图片、照片、音频、视频、图标、色彩、版面设计、电子文档）的所有权利（包括但不限于版权、商标权、专利权、商业秘密和其他所有相关权利）。未经有爱许可，任何人不得擅自使用如上内容（包括但不限于通过程序或设备监视、复制、转播、展示、镜像、上传、下载有爱相关网站或移动应用程序内的任何内容）。被授权浏览、复制、打印和传播属于有爱相关网站或移动应用程序内信息内容的，该等内容都不得用于商业目的且所有信息内容及其任何部分的使用都必须包括此权利声明。'
    ]
  },
  {
    title: '二、责任限制',
    children: [
      '2.1.用户在有爱平台的论坛、社区以及其他应用上，自行上传、提供、发布相关信息，包括但不限于用户名称、公司名称、联系人及联络信息，相关图片、资讯等，该等信息均由用户自行提供，用户须对其提供的任何信息依法承担全部责任。',
      '2.2. 有爱平台上转载作品（包括论坛内容）出于传递更多信息之目的，并不意味有爱赞同其观点或证实其内容的真实性。',
      '2.3.有爱在此提示，您在使用有爱服务期间应当遵守中华人民共和国的法律，不得危害网络安全，不得利用有爱的服务从事他人侵犯名誉、隐私、知识产权和其他合法权益的活动。尽管有前述提示，有爱不对您使用有爱服务的用途和目的承担任何责任。'
    ]
  },
  {
    title: '三、知识产权保护',
    children: [
      '我们尊重知识产权，反对并打击侵犯知识产权的行为。任何组织或个人认为有爱内容（如转载文章、发布的信息等）可能侵犯其合法权益的，可以通过向有爱提出书面权利通知，有爱将在收到知识产权权利人合格通知后依法尽快处理。'
    ]
  },
  {
    title: '隐私权政策',
    children: [
      '有爱深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。请在使用我们的互联网电子服务或商品前，仔细阅读并了解本声明和政策，我们将按照本声明和政策收集、处理及披露您的信息。',
      '本声明和政策将帮助您了解以下内容：',
      '1、定义',
      '2、我们可能收集的信息',
      '3、我们如何收集和使用您的个人信息',
      '4、我们如何使用 Cookie 和同类技术',
      '5、我们如何共享、转让、公开披露您的个人信息',
      '6、用户业务数据和公开信息',
      '7、我们如何保护您的个人信息',
      '8、您如何管理您的个人信息',
      '9、我们如何处理未成年人的个人信息',
      '10、您的个人信息如何在全球范围转移',
      '11、本声明和政策如何更新',
      '12、如何联系我们'
    ]
  },
  {
    title: '一、定义',
    children: [
      '1.1 个人信息',
      '指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。如姓名、出生日期、身份证件号码、个人生物识别信息、住址、通信通讯联系方式、通信记录和内容、账号密码、个人财产信息、住宿信息、健康生理信息、交易信息等。',
      '1.2 个人敏感信息',
      '包括身份证件号码、个人财产信息、个人生物识别信息、交易信息、14岁以下（含）儿童的个人信息等。',
      '1.3 个人信息删除',
      '指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。',
      '1.4 业务数据',
      '不同于个人信息，是指有爱的用户利用有爱的服务上传、下载、分发等通过有爱的技术服务处理的数据。',
      '二、我们可能收集的信息',
      '我们提供产品或服务时，可能会收集、储存和使用下列与您有关的个人信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。',
      '2.1 与个人身份无关',
      '当您使用有爱的产品或服务时，我们可能收集和汇总诸如用户的来源途径、访问顺序、停留时间等信息，例如记录使用有爱的产品或服务的每个用户的来源途径、浏览器软件等。',
      '2.2 与个人身份有关',
      '当您使用有爱的产品或服务时，我们可能收集和汇总或要求您提供有关个人身份的信息，例如：',
      '1、个人身份证明（包括身份证、社保卡、医师资格证、专业技术资格证/职称证、医师执业证等）；',
      '2、生日、籍贯、性别、个人电话号码、住址、工作信息；',
      '3、网络身份标识信息（包括系统账号、IP地址、电子邮箱地址及与前述有关的密码、口令、口令保护答案、用户个人数字证书等）；',
      '4、个人健康生理信息（个人因生病医治等产生的相关记录，如病症、住院志、医嘱单、检验报告、手术及麻醉记录、护理记录、药物食物过敏信息、生育信息、以往病史、诊治情况、家族病史、现病史等，以及与个人身体健康状况产生的相关信息，如体重、身高肺活量等）；',
      '5、个人财产信息（银行账号、鉴别信息、优惠券、兑换码等）；',
      '6、通讯信息（短信、音视频记录及内容）；',
      '7、联系人信息（通讯录）；',
      '8、个人上网记录和日志信息（包括网站浏览记录、软件使用记录、点击记录、操作日志等）；',
      '9、设备信息（包括设备型号、设备MAC地址、操作系统类型、设备设置）；',
      '10、软件列表唯一设备识别码（如IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息）；',
      '11、个人位置信息（包括精准定位信息、经纬度等）；',
      '12、其他有爱基于为您提供服务需要而收集或汇总的您的信息。'
    ]
  },
  {
    title: '三、我们如何收集和使用您的个人信息',
    children: [
      '我们会出于本声明和政策所述的以下目的，收集、储存和使用您的个人信息：',
      '3.1 用户注册与认证功能',
      '您需要注册一个账户，以便于我们为您提供服务。当您注册时，请您至少提供手机号码、密码，我们将通过发送短信验证码的方式验证您的身份是否有效。仅需使用浏览、搜索等基本服务，您不需要注册成为我们的会员及提供上述信息。',
      '您的登录名包括但不仅限于您的手机号、邮箱账号、用户名，您可以完善昵称、密码、头像、联系地址、出生日期等相关信息，补充这些“账户信息”将有助于我们为您提供更具个性化的服务。',
      '您需要向我们提供真实姓名和有效身份证件（包括但不限于身份证、医保卡、护照）的号码和复印件，以便于我们进行实名认证。如果您不提供这些信息，可能会影响您对有爱部分核心业务功能的正常使用，但不会影响您进行基本的浏览、搜索。',
      '如成为我们平台的注册医生，您需要提供包括但不仅限于手机号码、用户名。在注册登录过程中，如您提供以下额外信息，将有助于我们对您提供电子服务资格进行认证：您的真实姓名、性别、身份证正反面照片、联系信息（QQ/微信/邮箱地址）、医院电话、《执业医师资格证》、《医师执业证书》、《职称证》、您本人的真实头像。如果您未提供这些信息，将会影响到您在有爱进行的电子服务活动。',
      '在您主动注销账号时，我们将根据相关法律法规的要求尽快使其匿名或删除您的个人信息',
      '3.2 商品展示与医疗信息服务推送功能',
      '会根据您的浏览及搜索记录、设备信息、位置信息、历史问诊、个人生理健康信息、电子病历、关注医生等，提取您的浏览、搜索偏好、行为习惯、位置信息等特征，基于特征标签进行间接人群画像并展示、推送信息。',
      '3.3 互联网电子服务或商品提供功能',
      '3.3.1 您向我们提供的信息',
      '为便于您使用互联网电子服务或商品，您需提供真实姓名、手机号、身份证号等信息。',
      '为便于向您交付互联网电子服务或商品，您需提供收货人姓名、收货地址、邮政编码、收货人联系电话。如果我们委托第三方向您交付时，我们会在征得您同意后将上述信息共享给第三方。如果您拒绝提供此类信息，您理解并同意我们将无法完成相关交付服务。',
      '为更好地向您提供互联网电子服务，更加精准、快速地向您推荐互联网电子服务或商品，我们可能需要您在使用服务过程中提供病症、住院志、医嘱单、检验报告、手术及麻醉记录、护理记录、用药记录、药物食物过敏信息、生育信息、以往病史、诊治情况、家族病史、现病史、传染病史及其他个人健康生理信息，以及个人身体健康状况产生的体重、身高、肺活量和其他相关信息。如您不提供上述信息，将会影响您使用部分互联网电子服务或商品，但不影响您使用有爱产品或服务的基本浏览、搜索功能。',
      '为更好地支付费用，使用有爱合作金融机构进行理财等服务，可能需要您提供第三方支付平台如支付宝、微信等相关账户信息。如您不提供上述信息，将无法正常使用互联网电子服务或商品相关的支付等功能，但不影响您使用有爱产品或服务的基本浏览、搜索功能。',
      '3.3.2 我们在您使用服务过程中收集的信息的页面展示和搜索结果、了解产品适配性、识别账号异常状态，预防交易和资金风险，最终保障向您提供安全稳定的服务，我们会收集关于您使用的服务以及使用方式的信息并将这些信息进行关联，这些信息包括：',
      '设备信息：我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（例如设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息）、设备所在位置相关信息（例如IP 地址、GPS位置以及能够提供相关信息的Wi-Fi 接入点、蓝牙和基站等传感器信息）。',
      '日志信息：当您使用我们的网站或客户端提供的互联网电子服务或商品时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的搜索查询内容、IP地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间及您访问的网页记录等。',
      '如您不同意收集记录前述信息，我们可能无法完成风控验证。',
      '请注意，单独的设备信息、日志信息等是无法识别特定自然人身份的信息。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。',
      '为展示您的生理健康信息，我们会收集您在使用我们服务过程中产生的健康咨询详情（包括但不限于图片、文字、视频、语音）、预约挂号记录、检查检验、用药处方、医生诊断结果等用于向您展示及便于您对信息进行管理。',
      '当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。',
      '3.3.3 我们通过间接获得方式收集到的您的个人信息',
      '我们可能从第三方获取您授权共享的账户信息（头像、昵称、联系方式），并在您同意本声明和政策后将您的第三方账户与您的账户绑定，使您可以通过第三方账户直接登录并使用我们的互联网电子服务或商品。我们会将依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。',
      '您可通过同一账号在我们提供的链接入口使用我们关联公司提供的互联网电子服务或商品，为便于我们基于关联账号共同向您提供一站式服务并便于您统一进行管理，我们在有爱平台集中展示您的信息或推荐您感兴趣的信息。',
      '当您通过我们互联网电子服务或商品使用上述服务时，您授权我们根据实际业务及合作需要从我们关联公司处接收、汇总、分析我们确认其来源合法或您授权同意其向我们提供的您的个人信息或交易信息。',
      '如您拒绝提供上述信息或拒绝授权，可能无法使用我们关联公司的相应互联网电子服务或商品，或者无法展示相关信息，但不影响使用有爱的健康咨询等核心服务。',
      '3.4 为您提供安全保障',
      '请注意，为确保账户身份真实性、向您提供更好的安全保障，您可以向我们提供身份证、社保卡等身份信息，绑定银行卡等完成实名认证。如您拒绝提供上述信息，可能无法使用特定的互联网电子服务或商品、继续可能存在风险的操作等，但不会影响您使用浏览、搜索等服务。',
      '为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或有爱相关协议规则的情况，我们可能使用或整合您的账户信息、交易信息、设备信息、有关网络日志以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。',
      '3.5 其他用途',
      '我们将信息用于本声明和政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。',
      '3.6 征得授权同意的例外',
      '根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：',
      '1、与国家安全、国防安全有关的；',
      '2、与公共安全、公共卫生、重大公共利益有关的；',
      '3、与犯罪侦查、起诉、审判和判决执行等有关的；',
      '4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；',
      '5、所收集的个人信息是您自行向社会公众公开的；',
      '6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；',
      '7、根据您的要求签订合同所必需的；',
      '8、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；',
      '9、为合法的新闻报道所必需的；',
      '10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；',
      '11、法律法规规定的其他情形。',
      '如我们停止运营有爱平台，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。',
      '3.7 设备权限调用',
      '为向您提供便捷、优质的服务，我们可能会调用您设备的一些权限，以下是我们可能调用的设备权限列表及对应的使用目的说明，您有权随时选择关闭下列权限的授权，但可能会影响您正常使用我们互联网电子服务或商品的部分或全部功能。',
      '1、相机',
      '用于用户使用互联网电子服务或商品时拍摄并上传照片。用户使用行相应服务前会弹窗询问，可关闭该权限，但会影响用户正常使用相关服务。',
      '2、通知',
      '用于接受问诊、支付结果、患者问诊等各类问诊消息。用户首次打开客户端时会弹窗询问，可关闭该权限，但会影响用户正常接收各类消息和提醒。',
      '3、麦克风',
      '用于问诊服务，用户使用行相应服务前会弹窗询问，可关闭该权限，但会影响用户正常使用服务的正常交流。',
      '4、无线数据',
      '用于设备连接网络，用户首次打开客户端时会弹窗询问，可关闭该权限，但会导致移动客户端无法正常使用。',
      '5、WLAN',
      '用于设备连接网络，用户首次打开客户端时会弹窗询问，可关闭该权限，但会导致移动客户端无法正常使用。'
    ]
  },
  {
    title: '四、我们如何使用 Cookie 和同类技术',
    children: [
      '4.1 Cookie',
      '为确保有爱平台的正常运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，有爱平台能够记住您的选择，提供个性化增强服务等。',
      '您可根据自己的偏好管理或删除Cookie。有关详情，请参见 AboutCookies.org。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止 Cookie 的功能。但如果您这么做，则需要在每一次访问有爱平台时更改用户设置。如需详细了解如何更改浏览器设置，请访问您使用的浏览器的相关设置页面。',
      '4.2 网站信标和像素标签',
      '除 Cookie 外，我们还会在有爱平台上使用平台信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们有爱平台内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。'
    ]
  },
  {
    title: '五、我们如何共享、转让、公开披露您的个人信息',
    children: [
      '如果为了向您提供服务而需要将您的信息共享至第三方，我们将评估该第三方收集信息的合法性、正当性、必要性。我们将要求第三方对您的信息采取保护措施并且严格遵守相关法律法规与监管要求。另外，我们会按照法律法规及国家标准的要求以确认协议、具体场景下的文案确认、弹窗提示等形式征得您的同意或确认第三方已经征得您的同意。',
      '5.1 共享',
      '我们不会与有爱服务提供者以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：',
      '1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。',
      '2、我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。',
      '3、与关联公司间共享：为便于我们基于关联账号共同向您提供服务，推荐您可能感兴趣的信息或保护有爱关联公司或其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我们的关联公司共享。我们只会共享必要的个人信息（如为便于您通过同一账号使用我们关联公司产品或服务，我们会向关联公司共享您必要的账户信息），如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。',
      '4、与授权合作伙伴共享：仅为实现本声明和政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。这些支持包括为我们的供货或提供基础设施技术服务、物流配送服务、支付服务、数据处理等。我们共享这些信息的目的是可以实现我们产品与/或服务的核心购物功能，比如我们必须与物流服务提供商共享您的订单信息才能安排送货；或者我们需要将您的订单号和订单金额与第三方支付机构共享以实现其确认您的支付指令并完成支付等。',
      '我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。',
      '目前，我们的授权合作伙伴包括以下类型：',
      '(1）广告、分析服务类的授权合作伙伴。除非得到您的许可，否则我们不会将您的个人身份信息（指可以识别您身份的信息，例如姓名或电子邮箱，通过这些信息可以联系到您或识别您的身份）与提供广告、分析服务的合作伙伴分享。我们会向这些合作伙伴提供有关其广告覆盖面和有效性的信息，而不会提供您的个人身份信息，或者我们将这些信息进行汇总，以便它不会识别您。例如，只有在广告主同意遵守我们的广告发布准则后，我们才可能会告诉广告主他们广告的效果如何，或者有多少人看了他们广告或在看到广告后安装了应用，或者向这些合作伙伴提供不能识别个人身份的人口统计信息（例如“位于北京的25岁男性，喜欢软件开发”），帮助他们了解其受众或顾客。',
      '(2）供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务、支付便利或进行学术研究和调查。',
      '对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、声明和政策以及其他任何相关的保密和安全措施来处理个人信息。',
      '5.2 转让',
      '我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：',
      '1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；',
      '2、在有爱服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受声明和政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。',
      '5.3 公开披露',
      '我们仅会在以下情况下，公开披露您的个人信息：',
      '1、获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；',
      '2、如果我们确定您出现违反法律法规或严重违反有爱相关协议规则的情况，或为保护有爱及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或有爱相关协议规则征得您同意的情况下披露关于您的个人信息，包括相关违规行为以及有爱已对您采取的措施。例如，若您囤积号源、虚假预约而严重违反用户协议，我们可能会公开披露或与合作方共享您的身份信息、联系方式与处罚情况。',
      '5.4 共享、转让、公开披露个人信息时事先征得授权同意的例外',
      '以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：',
      '1、与国家安全、国防安全有关的；',
      '2、与公共安全、公共卫生、重大公共利益有关的；',
      '3、与犯罪侦查、起诉、审判和判决执行等有关的；',
      '4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；',
      '5、您自行向社会公众公开的个人信息；',
      '6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；',
      '根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。'
    ]
  },
  {
    title: '六、用户业务数据和公开信息',
    children: [
      '不同于您的个人信息，对于用户业务数据和公开信息，有爱将按如下方式处理：',
      '6.1 用户业务数据',
      '1、您通过有爱平台提供的互联网电子服务或商品，加工、存储、上传、下载、分发以及通过其他方式处理的数据，均为您的用户业务数据，您完全拥有您的用户业务数据。有爱作为服务提供商，我们只会严格执行您的指示处理您的业务数据，除按与您协商一致或执行明确的法律法规要求外，不对您的业务数据进行任何非授权的使用或披露。',
      '2、您应对您的用户业务数据来源及内容负责，有爱提示您谨慎判断数据来源及内容的合法性。因您的用户业务数据内容违反法律法规、部门规章或国家政策而造成的全部结果及责任均由您自行承担。',
      '3、根据您与有爱协商一致，有爱在您选定的数据中心存储用户业务数据。有爱恪守对用户的安全承诺，根据适用的法律保护用户存储在有爱数据中心的数据。',
      '6.2 公开信息',
      '1、公开信息是指您公开分享的任何信息，任何人都可以在使用和未使用有爱互联网电子服务或商品期间查看或访问这些信息。例如您在社区、论坛发布的信息。',
      '2、为使用有爱的互联网电子服务或商品，可能存在您必须公开分享的信息。',
      '3、在使用有爱平台进行交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址等。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。您也可以通过我们的服务建立联系和相互分享。当您通过我们的服务创建交流、交易或分享时，您可以自主选择沟通、交易或分享的对象，作为能够看到您的联络方式、交流信息或分享内容等相关信息的第三方。如您发现自己的个人信息泄漏，尤其是您的账户或密码发生泄露，请您立即联络客服，以便有爱采取相应措施。'
    ]
  },
  {
    title: '七、我们如何保护您的个人信息',
    children: [
      '7.1 我们已采取符合业界标准、合理可行的安全防护措施保护您提供的个人信息安全，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。例如，在您的浏览器与服务器之间交换数据（如信用卡信息）时受 SSL（Secure Socket Layer）协议加密保护；我们同时对有爱平台提供HTTPS（Hyper Text Transfer Protocol over Secure Socket Layer）协议安全浏览方式；我们会使用加密技术提高个人信息的安全性；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息；我们设立了个人信息保护责任部门，针对个人信息收集、使用、共享、委托处理等开展个人信息安全影响评估。同时，我们建立了相关内控制度，对可能接触到您的信息的工作人员采取最小够用授权原则；对工作人员处理您的信息的行为进行系统监控，不断对工作人员培训相关法律法规及隐私安全准则和安全意识强化宣导。另外，我们的相应网络/系统通过了国家网络安全等级保护的测评。我们每年还会聘请外部独立第三方对我们的信息安全管理体系进行评估。 但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。',
      '7.2 我们有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。目前，我们的重要信息系统已经通过公安部三级等级保护、ISO27001等认证。',
      '7.3 我们会采取合理可行的措施，尽力避免收集无关的个人信息。我们只会在达成本声明和政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。',
      '7.4 互联网并非绝对安全的环境，我们强烈建议您不要使用非有爱推荐的通信方式发送个人信息。您可以通过我们的服务建立联系和相互分享。当您通过我们的服务创建交流、交易或分享时，您可以自主选择沟通、交易或分享的对象，作为能够看到您的交易内容、联络方式、交流信息或分享内容等相关信息的第三方。',
      '在使用有爱平台进行网上健康咨询时，您不可避免地要向医务人员或客服披露自己的个人信息，如联系方式或身份信息。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息尤其是您的账户或密码发生泄露，请您立即联络客服，以便我们根据您的申请采取相应措施。',
      '请注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息，如您在大家帮发帖、评论时选择上传包含个人信息的图片。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。',
      '请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。',
      '7.5 我们将不定期更新并公开安全风险、个人信息安全影响评估报告等有关内容，您可通过有爱平台公告方式获得。',
      '7.6 在不幸发生个人信息安全事件后，我们将按照法律法规的要求向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。',
      '7.7 我们还将按照监管部门要求，上报个人信息安全事件的处置情况。'
    ]
  },
  {
    title: '八、您如何管理您的个人信息',
    children: [
      '您可以通过以下方式访问及管理您的个人信息：',
      '8.1 访问您的个人信息',
      '您有权访问您的个人信息，法律法规规定的例外情况除外。您可以通过以下方式自行访问您的个人信息：',
      '账户信息——如果您希望访问或编辑您的账户中的个人基本资料信息和实名认证信息、更改您的密码或添加绑定邮箱等，您可以登录账号通过“个人中心-账号设置”执行此类操作。',
      '健康档案信息：您可以在有爱 APP 中查阅或清除您的问诊咨询记录、预约挂号记录等。',
      '银行卡管理：您可以登陆账号，通过“个人中心-健康账户”进行银行卡的解绑、绑定。',
      '预约、问诊、购药记录：您可以登陆账号，通过“个人中心”查看了解历史记录。',
      '家庭联系人管理：您可以通过登陆账号，在“个人中心-家庭联系人”中对联系人进行增删改操作。',
      '如果您无法通过上述路径访问该等个人信息，您可以随时通过客服中心与我们取得联系。我们将在15个工作日内回复您的访问请求。',
      '对于您在使用我们的互联网电子服务或商品过程中产生的其他个人信息，我们将根据本条“8.7 响应您的上述请求”中的相关安排向您提供。',
      '8.2 更正或补充您的个人信息',
      '当您发现我们处理的关于您的个人信息有错误时，您有权要求我们做出更正或补充。您可以通过“8.1访问您的个人信息”中列明的方式提出更正或补充申请。',
      '8.3 删除您的个人信息',
      '您可以通过“8.1访问您的个人信息”中列明的方式删除您的部分个人信息。',
      '在以下情形中，您可以向我们提出删除个人信息的请求：',
      '1、如果我们处理个人信息的行为违反法律法规；',
      '2、如果我们收集、使用您的个人信息，却未征得您的明确同意；',
      '3、如果我们处理个人信息的行为严重违反了与您的约定；',
      '4、如果您不再使用我们的产品或服务，或您主动注销了账号；',
      '5、如果我们永久不再为您提供产品或服务。',
      '若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，要求其及时删除，除非法律法规另有规定，或这些主体获得您的独立授权。',
      '当您从我们的服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。',
      '8.4 修改或撤回您授权同意的范围',
      '您可以通过删除信息、关闭设备功能、在有爱平台中进行隐私设置等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。',
      '请您理解，每个业务功能需要一些基本的个人信息才能得以完成（见本隐私权政策“我们如何收集和使用您的信息”）。当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。',
      '8.5 个人信息主体注销账户',
      '在符合有爱单项服务的服务协议约定条件及国家相关法律法规规定的情况下，您的该项有爱服务账号可能被注销或删除。当账号注销或被删除后，与该账号相关的、该单项服务项下的全部服务资料和数据将依照单项服务的服务协议约定删除或匿名化处理。',
      '8.6 约束信息系统自动决策',
      '在某些互联网电子服务或商品中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将在不侵害有爱商业秘密或用户权益、社会公共利益的前提下提供申诉方法。',
      '8.7 响应您的上述请求',
      '如您需要撤销授权信息或者注销、删除个人账号信息，您可通过(https://www.guahao.com/help/common)联系我们。为保障您的信息安全，我们可能需要您提供书面请求或其他方式证明您的身份，验证通过后即可处理您的请求。',
      '我们将会在15 个工作日内针对您的的请求做出答复。如您不满意，可通过客服中心发起投诉。',
      '对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。',
      '在以下情形中，按照法律法规要求，我们将无法响应您的请求：',
      '1、与国家安全、国防安全有关的；',
      '2、与公共安全、公共卫生、重大公共利益有关的；',
      '3、与犯罪侦查、起诉、审判和执行判决等有关的；',
      '4、有充分证据表明个人信息主体存在主观恶意或滥用权利的；',
      '5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；',
      '6、涉及商业秘密的。'
    ]
  },
  {
    title: '九、我们如何处理未成年人的个人信息',
    children: [
      '如果没有父母或监护人的同意，未成年人不得创建自己的用户账户。如您为未成年人的，建议您请您的父母或监护人仔细阅读本声明和政策，并在征得您的父母或监护人同意的前提下使用我们的互联网电子服务或商品或向我们提供信息。',
      '对于经父母或监护人同意使用我们的互联网电子服务或商品而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。',
      '根据当地监管部门的相关规定，有爱仅对满足特定年龄要求的用户提供互联网电子服务或商品。'
    ]
  },
  {
    title: '十、您的个人信息如何在全球范围转移',
    children: [
      '我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内，以下情形除外：',
      '1、法律法规有明确规定；',
      '2、获得您的明确授权；',
      '3、您通过互联网进行海外互联网电子服务或商品等个人主动行为。',
      '针对以上情形，我们会确保依据本声明和政策对您的个人信息提供足够的保护。'
    ]
  },
  {
    title: '十一、本声明和政策如何更新',
    children: [
      '我们的本声明和政策可能变更。',
      '未经您明确同意，我们不会削减您按照本声明和政策所应享有的权利。 我们会在本页面上发布对本声明和政策所做的任何变更。',
      '对于重大变更，我们还会提供更为显著的通知（包括我们会通过网站公示的方式进行通知、私信通知、甚至向您提供弹窗提示）。',
      '本声明和政策所指的重大变更包括但不限于：',
      '1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；',
      '2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；',
      '3、个人信息共享、转让或公开披露的主要对象发生变化；',
      '4、您参与个人信息处理方面的权利及其行使方式发生重大变化；',
      '5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；',
      '6、个人信息安全影响评估报告表明存在高风险时。',
      '我们还会将本声明和政策的旧版本存档，供您查阅。',
      '若您不同意修改后的隐私政策，您有权并应立即停止使用我们的服务。如果您继续使用我们的服务，则视为您接受知乎对本政策相关条款所做的修改。',
      ''
    ]
  }
]

export { REGISTRATION_AGREEMENT, PRIVACY_POLICY }